info_shops = [
    [21, 'Магнит', 'Большая Садовая ул. 154', '+7(861)210-98-10'],
    [22, 'Перекрёсток', 'Буденовский просп. 49/97', '8(800)200-95-55'],
    [23, 'Пятёрочка', 'ул. Станиславкого 85', '8(800)555-55-05'],
    [24, 'Пятёрочка', 'Пушкинская ул. 50А', '8(800)555-55-05'],
    [25, 'Магнит', 'ул. Ленина 152', '8(800)200-90-02'], 
    [26, 'Солнечный круг', 'ул. Ленина 235', '+7(863)227-88-88'],
    [27, 'Ашан', 'Поймменгная ул. 1', '8(800)700-58-00'],
    [28, 'Перекрёсток', 'просп Сельмаш 2', '8(800)200-95-55'],
    [29, 'Окей', 'ул. Малиновского, 23Д', '8(800)250-00-08'],
    [30, 'Солнечный круг', 'просп Стачки 46', '+7(863)227-88-88']
]